## Terraform Plan Results

| Step | Status |
|------|--------|
| 🖌️ Format | ✅ Success |
| ⚙️ Init | ✅ Success |
| ✅ Validate | ✅ Success |
| 📖 Plan | ✅ Success |

<details><summary>📋 Show Plan Output</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_task_definition.backend must be replaced
-/+ resource "aws_ecs_task_definition" "backend" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:498457470034:task-definition/keirekipro-backend-task:6" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-1:498457470034:task-definition/keirekipro-backend-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ memoryReservation = 448 -> 1792
                  - mountPoints       = []
                    name              = "keirekipro-backend"
                  - systemControls    = []
                  - volumesFrom       = []
                    # (6 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "keirekipro-backend-task" -> (known after apply)
      ~ memory                   = "512" -> "2048" # forces replacement
      ~ revision                 = 6 -> (known after apply)
        tags                     = {
            "Name" = "keirekipro-backend-task"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

</details>

*Pushed by: @DogisRiki, Action: `pull_request`*